<article class="mod-post mod-post__type-post">
	<header>
		<h1 class="mod-post__title">作为一个Web开发者，有多大的压力？</h1>
	</header>
	<div class="mod-post__entry wzulli"><p>这是在Quora上看到的一个回答，有点小感动，也表达了我作为Web开发者的心声，遂简单翻译过来。</p>
		<p><strong>Question</strong>：作为一个Web开发者，有多大的压力？</p>
		<h1 id="section"><strong>回答正文</strong>：</h1>
		<p>老实说，这确实是一份很有压力的工作。不像其他行业，Web 开发还处于快速发展的过程中，当下流行的技术几年后就会被人遗忘。所以你必须持续学习，一直在路上。此外大部分客户或者其它开发者不理解你的工作，认为这个很简单。因此当他们改变了deadline或者多次修改需求的时候，工作就变得更有压力，并且让人郁闷。还有改bug、技术面试等其它杂事也会让人产生压力。</p>
		<p>但是话说回来，我们大部分开发者都觉得很幸运，很幸运能成为这个行业的一部分，不论它多难或者压力多大，它带给我们的乐趣都是值得的。更何况我们能在做自己热爱的事业，投身到这个时代最瞩目的行业中，同时还能拿工资！</p>
		<p>有时候我们会吐槽工作压力，但我们内心深处都深深热爱它，不愿拿任何工作来交换。对于一份工作，这是非常高的评价。</p>
		<hr>
		<h1 id="section-1"><strong>我的想法</strong>：</h1>
		<p>从刚投入行业到现在，我的经验是，做的事情从<strong>“具体”到“抽象”</strong>，从<strong>“细节”到“规划”</strong>，不在第一线写代码，稍不留神就发现自己看不懂现在的开发模式了，一切都发生得太快。</p>
		<p>看一下这几年的前端开发模式变化：</p>
		<p><img title="" alt="" src="http://www.wpke.net/wp-content/uploads/2016/09/front-end-2016.jpg"></p>
		<p>具体深挖一下的话，可以搜索“front end 2016”，quora给出的结果显示，每一年前端技术框架和技术栈都不一样。</p>
		<p><img title="" alt="" src="http://www.wpke.net/wp-content/uploads/2016/09/front-end-2016-2.png"></p>
		<p><strong>变化太快让人没法停下来，但仔细想想，一直跑也挺好的。</strong></p>
		<p>最近在看《自私的基因》，书中说，基因的迷人和强大之处，就是它会复制自己，在整个世界的基因池中，无限地复制。复制过程中会有一些错误产生（叫做突变），于是产生了很多分支，环境会决定哪些分支比其它分支更能生存下去。</p>
		<p>在长达几十亿年的时间长度里，基因是非常不稳定的，外部条件能筛选出最适合生存的基因。Web开发行业正处在爆炸式发展之中，相当于把变异的时间强行缩短了几百倍，但是一些很内核的东西，可以在复制的过程保存下来。</p>
		<p><strong>当我们能够辨别出那些内核的时候，就会发现我们并不能选择做什么技术，是技术选择了我们。我们越接近内核，就越能在技术丛林中游刃有余。</strong></p>
	</div>
	<div class="mod-post__meta">
		<div>
			<div>
				— 于 <time datetime="2015年08月19日 10:20:52">2015年08月19日</time>
				，<span>共写了867个字</span>；
			</div>
			<div>— 文内使用到的标签：<span class="mod_tag"><a href="http://www.wpke.net/tag/%e5%bc%80%e5%8f%91%e8%80%85" rel="tag">开发者</a></span></div>
		</div>
	</div>
</article>
